<?php
echo "задание1: " ."<br>";
function printNumbers() {
    $number = 0;
    do {
        if ($number === 0) {
            echo $number . " – это ноль.<br>";
        } elseif ($number % 2 === 0) {
            echo $number . " – чётное число.<br>";
        } else {
            echo $number . " – нечётное число.<br>";
        }
        $number++;
    } while ($number <= 10);
}

// Вызов функции для вывода чисел от 0 до 10 с указанием их чётности или нечётности
printNumbers();

echo "задание2: " ."<br>";

// Создание массива с областями и городами
$regions = array(
    "Московская область" => array("Москва", "Зеленоград", "Клин"),
    "Ленинградская область" => array("Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"),
    // Другие области и города можно добавить аналогичным образом
);

// Вывод значений массива в указанном формате
foreach ($regions as $region => $cities) {
    echo $region . ":\n";
    echo implode(", ", $cities) . ".\n\n";
}

echo "задание3 : " ."<br>";

// Массив для транслитерации русских букв на латиницу
$translitArray = array(
    'а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'д' => 'd',
    'е' => 'e', 'ё' => 'yo', 'ж' => 'zh', 'з' => 'z', 'и' => 'i',
    'й' => 'y', 'к' => 'k', 'л' => 'l', 'м' => 'm', 'н' => 'n',
    'о' => 'o', 'п' => 'p', 'р' => 'r', 'с' => 's', 'т' => 't',
    'у' => 'u', 'ф' => 'f', 'х' => 'h', 'ц' => 'ts', 'ч' => 'ch',
    'ш' => 'sh', 'щ' => 'sch', 'ъ' => '', 'ы' => 'y', 'ь' => '',
    'э' => 'e', 'ю' => 'yu', 'я' => 'ya',
);

// Функция для транслитерации строки
function transliterate($string, $translitArray) {
    $result = '';
    $string = strtolower($string); // Приводим строку к нижнему регистру

    // Перебираем каждый символ строки
    for ($i = 0; $i < strlen($string); $i++) {
        $char = substr($string, $i, 1);
        // Если символ есть в массиве транслитерации, добавляем соответствующий символ
        if (array_key_exists($char, $translitArray)) {
            $result .= $translitArray[$char];
        } else {
            $result .= $char; // Иначе оставляем символ без изменений
        }
    }
    return $result;
}

// Пример использования функции
$string = "Привет, мир!";
echo "Транслитерация строки \"$string\": " . transliterate($string, $translitArray);

echo "задание1: " ."<br>";



echo "задание1: " ."<br>";



echo "задание1: " ."<br>";
?>
